/*
Дана сторона квадрата a. Найти его периметр P = 4·a. 
Ванян Гор 303ИС-22
03.05.25
Выполнил за 2 минуту 
*/
#include <stdio.h>

int main() {
	float a, P;
	scanf("%f", &a);
	P = 4 * a;
	printf("%f\n", P);
	return 0;
}
